In [26]:
import pandas as pd
from glob import glob

In [30]:
#import all csv_files

csv_files = glob("./All Data Files/*.csv")
csv_files

['./All Data Files/tmdb.movies.csv',
 './All Data Files/title.crew.csv',
 './All Data Files/title.basics.csv',
 './All Data Files/tn.movie_budgets.csv',
 './All Data Files/name.basics.csv',
 './All Data Files/title.akas.csv',
 './All Data Files/bom.movie_gross.csv',
 './All Data Files/title.principals.csv',
 './All Data Files/title.ratings.csv']

In [31]:
tsv_files = glob("./All Data Files/*.tsv")
tsv_files

['./All Data Files/rt.reviews.tsv', './All Data Files/rt.movie_info.tsv']

In [32]:
data_csv = {}
data_tsv = {}
for file in csv_files:
    data_csv[file] = pd.read_csv(file)

#for file in tsv_files:
    #data_tsv[file] = pd.read_csv(file, sep='\t')

In [33]:
type(data_csv)

dict

In [34]:
data_csv.keys()

dict_keys(['./All Data Files/tmdb.movies.csv', './All Data Files/title.crew.csv', './All Data Files/title.basics.csv', './All Data Files/tn.movie_budgets.csv', './All Data Files/name.basics.csv', './All Data Files/title.akas.csv', './All Data Files/bom.movie_gross.csv', './All Data Files/title.principals.csv', './All Data Files/title.ratings.csv'])

In [35]:
df_1 = data_csv['./All Data Files/tmdb.movies.csv']
df_2 = data_csv['./All Data Files/title.crew.csv']
df_3 = data_csv['./All Data Files/title.basics.csv']
df_4 = data_csv['./All Data Files/tn.movie_budgets.csv']
df_5 = data_csv['./All Data Files/name.basics.csv']
df_6 = data_csv['./All Data Files/title.akas.csv']
df_7 = data_csv['./All Data Files/bom.movie_gross.csv']
df_8 = data_csv['./All Data Files/title.principals.csv']
df_9 = data_csv['./All Data Files/title.ratings.csv']

df_1['vote_average'].value_counts()

In [274]:
df_1.head()

,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [278]:
df_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   genre_ids          26517 non-null  object
 1   id                 26517 non-null  int64
 2   original_language  26517 non-null  object
 3   original_title     26517 non-null  object
 4   popularity         26517 non-null  float64
 5   release_date       26517 non-null  object
 6   title              26517 non-null  object
 7   vote_average       26517 non-null  float64
 8   vote_count         26517 non-null  int64
dtypes: float64(2), int64(2), object(5)
memory usage: 1.8+ MB

In [291]:
#dropping column to clean unncessary data
df_1 = df_1.drop(['Unnamed: 0'], axis=1)

In [292]:
#checking data
df_1.columns

Index(['genre_ids', 'id', 'original_language', 'original_title', 'popularity',
       'release_date', 'title', 'vote_average', 'vote_count'],
      dtype='object')

In [36]:
# Checking Missing and Null values
df_1.isna().sum()

Unnamed: 0           0
genre_ids            0
id                   0
original_language    0
original_title       0
popularity           0
release_date         0
title                0
vote_average         0
vote_count           0
dtype: int64

In [89]:
df_1.to_csv('df_1_cleaned.csv')

# df_1 (tmbd.movies) data cleaning summary:

The data in tmdb.movies has no missing values and seems clean. Proceeding with cleaning the rest of the datasets. Further Data Cleaning to be done once we know exactly what data is useful for our analysis.

# Taking first look at df_2 (title.crew); starting cleaning and initial analysis

In [37]:
df_2.head()

      tconst                      directors              writers
0  tt0285252                      nm0899854            nm0899854
1  tt0438973                            NaN  nm0175726,nm1802864
2  tt0462036                      nm1940585            nm1940585
3  tt0835418                      nm0151540  nm0310087,nm0841532
4  tt0878654  nm0089502,nm2291498,nm2292011            nm0284943

In [38]:
df_2.shape

(146144, 3)

In [39]:
df_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 3 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   tconst     146144 non-null  object
 1   directors  140417 non-null  object
 2   writers    110261 non-null  object
dtypes: object(3)
memory usage: 3.3+ MB

In [40]:
df_2.isna().sum()

tconst           0
directors     5727
writers      35883
dtype: int64

# df_2  (title.crew) data cleaning and summary:

title.crew has coded data. Will come back to this dataset after reviewing the others. We might not use this dataset if it doesnt add value.

# Taking a first look at df_3 (title.basics) dataset; starting cleaning and initial analysis.

In [41]:
df_3

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
...,...,...,...,...,...,...
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,NaN
146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,NaN,Documentary

In [42]:
df_3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   tconst           146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

In [43]:
# Checking Missing and Null values
df_3.isna().sum()

tconst                 0
primary_title          0
original_title        21
start_year             0
runtime_minutes    31739
genres              5408
dtype: int64

In [44]:
df_3.shape

(146144, 6)

In [45]:
#Replacing NaN Runtime values with the Median value. (Mean and Median were almost the same for this column)
median_runtime = df_3.runtime_minutes.median()
df_3.runtime_minutes.fillna(median_runtime, inplace=True)

In [46]:
#df_3 = df_3.apply(genres_{})
df_3.original_title.dropna(inplace=True)

In [47]:
df_3.isna().sum()

tconst                0
primary_title         0
original_title       21
start_year            0
runtime_minutes       0
genres             5408
dtype: int64

In [49]:
df_3.genres.dropna(axis=0, inplace=True)

In [50]:
df_3.isna().sum()

tconst                0
primary_title         0
original_title       21
start_year            0
runtime_minutes       0
genres             5408
dtype: int64

In [53]:
df_3.dropna(axis=0, inplace=True)

In [54]:
df_3.isna().sum()

tconst             0
primary_title      0
original_title     0
start_year         0
runtime_minutes    0
genres             0
dtype: int64

In [55]:
# Exporting to a csv file
df_3_cleaned = df_3.to_csv('df_3_cleaned.csv', index=False)

# df_3 (Title.basics) Data Cleaning Summary:

Data cleaning complete for this dataset.

# Taking first look at df_4 (movie_budgets); Data cleaning and initial analysis:

In [56]:
df_4.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [57]:
df_4.shape

(5782, 6)

In [58]:
#Removing '$' and ',' from columns and converting them to int types.
df_4['production_budget'] = df_4['production_budget'].str.replace('$' , '').str.replace(',', '').astype(int)

In [59]:
#Removing '$' and ',' from remaining columns and converting them to int types.
df_4['domestic_gross'] = df_4['domestic_gross'].str.replace('$' , '').str.replace(',', '').astype(int)
df_4['worldwide_gross'] = df_4['worldwide_gross'].str.replace('$' , '').str.replace(',', '').astype(int)
df_4
df_4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   int64
 4   domestic_gross     5782 non-null   int64
 5   worldwide_gross    5782 non-null   int64
dtypes: int64(4), object(2)
memory usage: 271.2+ KB

In [60]:
# Create column for total profit
df_4['total_profit'] = df_4['worldwide_gross'] - df_4['production_budget']

In [61]:
# Sort Dataframe by profit values
df_4.sort_values(by='total_profit', ascending=False)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,total_profit
0,1,"Dec 18, 2009",Avatar,425000000,760507625,2776345279,2351345279
42,43,"Dec 19, 1997",Titanic,200000000,659363944,2208208395,2008208395
6,7,"Apr 27, 2018",Avengers: Infinity War,300000000,678815482,2048134200,1748134200
5,6,"Dec 18, 2015",Star Wars Ep. VII: The Force Awakens,306000000,936662225,2053311220,1747311220
33,34,"Jun 12, 2015",Jurassic World,215000000,652270625,1648854864,1433854864
...,...,...,...,...,...,...,...
352,53,"Apr 27, 2001",Town & Country,105000000,6712451,10364769,-94635231
341,42,"Jun 14, 2019",Men in Black: International,110000000,3100000,3100000,-106900000
193,94,"Mar 11, 2011",Mars Needs Moms,150000000,21392758,39549758,-110450242
194,95,"Dec 31, 2020",Moonfall,150000000,0,0,-150000000
2,3,"Jun 7, 2019",Dark Phoenix,350000000,42762350,149762350,-200237650

In [76]:
# making the movie column lowercase to allow for better merging with other datasets. 
df_4['movie'] = df_4['movie'].str.lower()

In [78]:
# Creating new column to check profitability.
df_4['was_it_profitable_domestically'] = (df_4['domestic_gross'] - df_4['production_budget']) > 0

In [82]:
#changing Date format for 'release_date' column
df_4['release_date'] = pd.to_datetime(df_4['release_date'], infer_datetime_format=True)
df_4

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,total_profit,was_it_profitable_domestically
0,1,2009-12-18,avatar,425000000,760507625,2776345279,2351345279,True
1,2,2011-05-20,pirates of the caribbean: on stranger tides,410600000,241063875,1045663875,635063875,False
2,3,2019-06-07,dark phoenix,350000000,42762350,149762350,-200237650,False
3,4,2015-05-01,avengers: age of ultron,330600000,459005868,1403013963,1072413963,True
4,5,2017-12-15,star wars ep. viii: the last jedi,317000000,620181382,1316721747,999721747,True
...,...,...,...,...,...,...,...,...
5777,78,2018-12-31,red 11,7000,0,0,-7000,False
5778,79,1999-04-02,following,6000,48482,240495,234495,True
5779,80,2005-07-13,return to the land of wonders,5000,1338,1338,-3662,False
5780,81,2015-09-29,a plague so pleasant,1400,0,0,-1400,False
5781,82,2005-08-05,my date with drew,1100,181041,181041,179941,True

In [83]:
# exporting cleaned dataset to csv, for further analysis
df_4.to_csv('df_4_cleaned_profits.csv')

# df_4 (movie_budgets) Data Cleaning Summary:

integer numbers have been cleaned for computation during analysis.

# Taking first look at df_5 (name_basics); data cleaning and initial analysis:

In [394]:
df_5

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"
...,...,...,...,...,...,...
606643,nm9990381,Susan Grobes,NaN,NaN,actress,NaN
606644,nm9990690,Joo Yeon So,NaN,NaN,actress,"tt9090932,tt8737130"
606645,nm9991320,Madeline Smith,NaN,NaN,actress,"tt8734436,tt9615610"
606646,nm9991786,Michelle Modigliani,NaN,NaN,producer,NaN
606647,nm9993380,Pegasus Envoyé,NaN,NaN,"director,actor,writer",tt8743182

In [26]:
#Checking for null values
df_5.isna().sum()

nconst                     0
primary_name               0
birth_year            523912
death_year            599865
primary_profession     51340
known_for_titles       30204
dtype: int64

In [65]:
# Since Their is no other useful data in this dataset, apart from "known_for_titles", We will drop 'birth_year' and'death_year

df_5.drop('birth_year', axis=1, inplace=True)
df_5.drop('death_year', axis=1, inplace=True)

In [66]:
#dropping all na values for the dataset. The missing values are all specific text values and render no value if filled with a placeholder.

df_5.dropna(inplace=True)

In [75]:
#Dropping the rest of the null values.
df_5.isna().sum()

nconst                0
primary_name          0
primary_profession    0
known_for_titles      0
dtype: int64

# df_5 (name_basics) data cleaning summary:

birth_year and death_year columns removed to make further analysis easier.